{
  "StepData": [
    {
      "id": 0,
      "step": 1,
      "title": "Repository",
      "type" : "repo",
      "content": "Create a repository to start a new open-source project. You can choose the environment(e.g., programming language, framework, gitignore, etc.) for your project. Then, your project's environment will be set!"
    },
    {
      "id": 1,
      "step": 2,
      "title": "License",
      "type" : "license",
      "content": "The license specifies the usage method and the scope of the terms and conditions between the copyright holder and the user. For a repository to be open source, you must license other users to use, change, and distribute the software freely. We show you the licenses provided by GitHub. You can determine and select a license based on the information provided about it."
    },
    {
      "id": 2,
      "step": 3,
      "title": "Pull-Request Template",
      "type" : "pr",
      "content": "Pull-Request template (PR template) is a template of a PR body that is entered when pr is performed. This standardizes the description format so that the code can be easily understood and identifies the parts that need to be checked during PR. We provide you with PR templates of several famous open source projects. You can choose and edit the template that is appropriate for you."
    },
    {
      "id": 3,
      "step": 4,
      "title": "Issue Template",
      "type" : "issue",
      "content": "You can standardize the description by creating and using an issue template. We provides Issue Template references for several well-known open-source projects for different situations, making it easy for users to create an Issue Template."
    },
    {
      "id": 4,
      "step": 5,
      "title": "CONTRIBUTING.md",
      "type" : "contributing",
      "content": "CONTRIBUTING.md is a document that specifies information for contributors. This file can contain various information such as build requirements, development environment setting methods, and code writing guides. We provides references to CONTRIBUTING.md for several well-known open-source projects, while also making it easy to create CONTRIBUTING.md through markdown previewer."
    },
    {
      "id": 5,
      "step": 6,
      "title": "README.md",
      "type" : "readme",
      "content": "README.md is the first document you see in the repository and describes many of the projects. We provides references to README.md for several well-known open-source projects, while also making it easy to create README.md through markdown previewer."
    }
  ]
}
